In [2]:
import pandas as pd
nlo = pd.read_csv('./data/nlo.csv', sep=',')

nlo_df = nlo.copy()
nlo_df.head()

                   City Colors Reported Shape Reported State             Time
0                Ithaca             NaN       TRIANGLE    NY   6/1/1930 22:00
1           Willingboro             NaN          OTHER    NJ  6/30/1930 20:00
2               Holyoke             NaN           OVAL    CO  2/15/1931 14:00
3               Abilene             NaN           DISK    KS   6/1/1931 13:00
4  New York Worlds Fair             NaN          LIGHT    NY  4/18/1933 19:00

## Преобразование даты в формат datetime

In [3]:
nlo_df['Time'] = pd.to_datetime(nlo_df['Time'], errors='coerce')
nlo_df.head()

,City,Colors Reported,Shape Reported,State,Time
0,Ithaca,NaN,TRIANGLE,NY,1930-06-01 22:00:00
1,Willingboro,NaN,OTHER,NJ,1930-06-30 20:00:00
2,Holyoke,NaN,OVAL,CO,1931-02-15 14:00:00
3,Abilene,NaN,DISK,KS,1931-06-01 13:00:00
4,New York Worlds Fair,NaN,LIGHT,NY,1933-04-18 19:00:00

# Задание 3.4
## В каком году отмечается наибольшее количество случаев наблюдения НЛО в США?

In [29]:
nlo_df['Time'].dt.year.value_counts().head(1)

1999    2774
Name: Time, dtype: int64

# Задание 3.5
## Найдите средний интервал времени (в днях) между двумя последовательными случаями наблюдения НЛО в штате Невада (NV).

In [26]:
nlo_df[(nlo_df['State'] == 'NV')]['Time'].diff().dt.days.mean()

68.44876325088339